In [1]:
import pandas as pd

In [3]:
df = pd.read_csv(r"Downloads/drinks.csv")

In [4]:
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [5]:
#1 For the given data find mean, standard deviation and variance in excel?


df.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [6]:
df.var()

C:\Users\jay62\AppData\Local\Temp\ipykernel_28040\1568254755.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

beer_servings                   10229.927191
spirit_servings                  7794.119765
wine_servings                    6351.707200
total_litres_of_pure_alcohol       14.237779
dtype: float64

In [7]:
df.std()

C:\Users\jay62\AppData\Local\Temp\ipykernel_28040\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

beer_servings                   101.143103
spirit_servings                  88.284312
wine_servings                    79.697598
total_litres_of_pure_alcohol      3.773298
dtype: float64

In [11]:
s1 = df.sample(10)

In [12]:
s2 = df.sample(10)

In [15]:
s3 = df.sample(10)

In [16]:
s4 = df.sample(10)

In [19]:
s1.mean()

C:\Users\jay62\AppData\Local\Temp\ipykernel_28040\4203426239.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  s1.mean()

beer_servings                   55.70
spirit_servings                 39.60
wine_servings                   34.90
total_litres_of_pure_alcohol     2.49
dtype: float64

In [20]:
s2.mean()

C:\Users\jay62\AppData\Local\Temp\ipykernel_28040\2310008770.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  s2.mean()

beer_servings                   87.40
spirit_servings                 51.80
wine_servings                   28.10
total_litres_of_pure_alcohol     2.99
dtype: float64

In [21]:
s3.mean()

C:\Users\jay62\AppData\Local\Temp\ipykernel_28040\1540027735.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  s3.mean()

beer_servings                   85.40
spirit_servings                 93.40
wine_servings                   64.60
total_litres_of_pure_alcohol     4.42
dtype: float64

In [22]:
s4.mean()

C:\Users\jay62\AppData\Local\Temp\ipykernel_28040\3931768698.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  s4.mean()

beer_servings                   116.20
spirit_servings                  90.20
wine_servings                    46.30
total_litres_of_pure_alcohol      5.59
dtype: float64

In [39]:
sample_mean = (55.70 + 87.40 + 85.40 + 116.20) / 4

In [40]:
sample_mean

86.17500000000001

In [52]:
s1

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
103,Maldives,0,0,0,0.0,Asia
30,Cambodia,57,65,1,2.2,Asia
173,Tonga,36,21,5,1.1,Oceania
11,Bahamas,122,176,51,6.3,North America
150,Senegal,9,1,7,0.3,Africa
156,Slovenia,270,51,276,10.6,Europe
89,Kiribati,21,34,1,1.0,Oceania
47,DR Congo,32,3,1,2.3,Africa
137,Qatar,1,42,7,0.9,Asia
80,Iraq,9,3,0,0.2,Asia

In [45]:
s1.std()

C:\Users\jay62\AppData\Local\Temp\ipykernel_28040\1690272128.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  s1.std()

beer_servings                   83.620904
spirit_servings                 53.229482
wine_servings                   86.102587
total_litres_of_pure_alcohol     3.388362
dtype: float64

In [46]:
s2.std()

C:\Users\jay62\AppData\Local\Temp\ipykernel_28040\1001046975.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  s2.std()

beer_servings                   118.302062
spirit_servings                  49.353149
wine_servings                    67.419829
total_litres_of_pure_alcohol      2.968894
dtype: float64

In [47]:
s3.std()

C:\Users\jay62\AppData\Local\Temp\ipykernel_28040\1495299299.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  s3.std()

beer_servings                   88.057052
spirit_servings                 99.916854
wine_servings                   85.515691
total_litres_of_pure_alcohol     3.736546
dtype: float64

In [48]:
s4.std()

C:\Users\jay62\AppData\Local\Temp\ipykernel_28040\1845015931.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  s4.std()

beer_servings                   124.154742
spirit_servings                  81.654829
wine_servings                    97.842333
total_litres_of_pure_alcohol      4.042125
dtype: float64

In [50]:
import numpy as np

In [51]:
#From the given data, take a sample and find mean, standard deviation and variance for population in excel. 
#Also, validate Central Limit Theorem in python as discussed in the class.


print(np.std([83.62 , 118.30 , 88.05 , 124.15]))   #STD of total 4 sample STD

17.884181558013776

In [54]:
print(np.std([0 , 36, 122, 9, 270, 21 , 32, 1, 9]))

83.61965626322706

In [28]:


alpha = 0.10
claimed_value = 101.14

from scipy.stats import ttest_1samp

In [29]:
x = [55.70 , 87.40 , 85.40 , 116.20]

ttest_1samp(x , popmean = claimed_value)

Ttest_1sampResult(statistic=-1.2110603744704183, pvalue=0.31257234517028437)

In [ ]:
#4 Theory Task: Validate Hypothesis for the problem statement discussed by your mentor.


#H0 : NULL Hypothesis
#H1 : Alternate Hypothesis
    
#If P is greater than alpha then H0 is true otherwise false.

#We will find mean of total samples then from each sample mean we can find P value. 

#Critial value's P value is considered as alpha.

In [ ]:
#3. In Null Value imputation and outlier removal, which concepts of statistics does get used ? and how ?



#NUll value imputation 


#1 - Deleting the column with missing data.
#2 - Filling the Missing Values using fillna function to impute data.



#Z Score Method

#Statistical outlier detection involves applying statistical tests or procedures to identify extreme values.

#You can convert extreme data points into z scores that tell you how many standard deviations away they are from the mean.

#If a value has a high enough or low enough z score, it can be considered an outlier. 



#IQR MEthod

#The interquartile range (IQR) tells you the range of the middle half of your dataset. 

#You can use the IQR to create “fences” around your data and then define outliers as any values that fall outside those fences.